#+TITLE: Implementing the Query Engine
#+AUTHOR: Fabricio Puente-Mansilla
#+DATE: <2026-05-16 Sat>
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :results output :exports both

* Elisp Demonstration: Simulating the Pipeline

We can simulate this "Stream of Frames" concept in Emacs Lisp using
lists of association lists (alists). Evaluate this block to see how an
empty frame is expanded by a query, and then filtered by a second
query.

#+BEGIN_SRC elisp
  (setq database '(((job . "wizard") (name . "Ben"))
                   ((job . "programmer") (name . "Alyssa"))
                   ((job . "trainee") (name . "Louis"))))

  ;; Our starting point: A stream containing one empty frame
  (setq initial-stream '( () ))

  (defun query-all-employees (input-stream)
    "Simulates a query that matches every employee in the DB."
    (let ((output-stream nil))
      (dolist (frame input-stream)
        (dolist (entry database)
          ;; We extend the empty frame with the DB entry
          (push (append entry frame) output-stream)))
      output-stream))

  (defun query-not-trainee (input-stream)
    "Simulates (NOT (job ?x trainee)) acting as a filter."
    (let ((output-stream nil))
      (dolist (frame input-stream)
        ;; If the frame says they are a trainee, drop them.
        ;; Otherwise, pass them through to the output stream.
        (unless (string= (cdr (assoc 'job frame)) "trainee")
          (push frame output-stream)))
      (nreverse output-stream)))

  ;; The Pipeline: AND (query-all-employees) (query-not-trainee)
  (princ "Running Stream Pipeline:\n")
  (let* ((stream-1 (query-all-employees initial-stream))
         (stream-2 (query-not-trainee stream-1)))
    (dolist (final-frame stream-2)
      (princ (format "Result Frame: %s\n" final-frame))))
#+END_SRC

#+RESULTS:
: Running Stream Pipeline:
: Result Frame: ((job . programmer) (name . Alyssa))
: Result Frame: ((job . wizard) (name . Ben))

* Elisp Demonstration: The "Brutal" Renamer

We can easily replicate the variable renaming algorithm in Emacs
Lisp. Think of this as analogous to how the C preprocessor expands
macros, substituting symbols before actual execution begins.

#+BEGIN_SRC elisp
  (defun rename-variables (rule-body id)
    "Recursively renames logic variables by appending an ID."
    (cond ((null rule-body) nil)
          ((symbolp rule-body)
           (let ((name (symbol-name rule-body)))
             ;; If the symbol starts with "?", it's a variable
             (if (string-prefix-p "?" name)
                 (intern (format "%s-%d" name id))
               rule-body)))
          ((listp rule-body)
           ;; Recursively traverse the list structure
           (cons (rename-variables (car rule-body) id)
                 (rename-variables (cdr rule-body) id)))
          (t rule-body)))

  ;; Let's test the brutal renaming on a mock rule
  (setq mock-rule '(rule (boss ?x ?y) (manages ?y ?x)))

  (princ (format "Original Rule: %s\n" mock-rule))
  ;; Apply the rule with a unique ID of 42
  (princ (format "Renamed Rule:  %s\n" (rename-variables mock-rule 42)))
#+END_SRC

#+RESULTS:
: Original Rule: (rule (boss 120 121) (manages 121 120))
: Renamed Rule:  (rule (boss 120 121) (manages 121 120))

---

